In [1]:
import pandas as pd
import numpy as np

In [5]:
#Concatenation - Combining multiple DataFrames - Rows, or columns must be the same

In [9]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']}

In [10]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [15]:
one = pd.DataFrame(data_one)

In [16]:
two = pd.DataFrame(data_two)

In [17]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [13]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [19]:
#Concatenate Columns
pd.concat([one, two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [25]:
#Concatenate Rows - Combining columns to the same value - Renames both DF to A, B

In [22]:
two.columns = one.columns

In [26]:
pd.concat([one, two], axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [27]:
#Reset index

In [32]:
mydf = pd.concat([one, two], axis=0)

In [33]:
mydf.index = range(len(mydf))

In [34]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3